TU_244/TU_244/Deliverable/SAMPLE fILE/APS-AMD-GPDRequest-GBPTransfer.xml

<NS1:Envelope xmlns:NS1="http://schemas.xmlsoap.org/soap/envelope/">
	<NS1:Header>
		<NS2:ServiceRequest xmlns:NS2="http://www.lloydstsb.com/Schema/Infrastructure/SOAP">
			<NS2:ServiceName>http://xml.lloydsbanking.com/Schema/Enterprise/TMH/AMD/AMDServices/NPADetails/1.1</NS2:ServiceName>
			<NS2:Action>AMD</NS2:Action>
			<NS2:From>wmbda501</NS2:From>
		</NS2:ServiceRequest>
		<NS3:Security xmlns:NS3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<NS3:UsernameToken Id="LloydsTSBSecurityToken" NS3:UNPMechanismType="LTPA" NS3:UserType="045">
				<NS3:Username>AMD</NS3:Username>
			</NS3:UsernameToken>
		</NS3:Security>
		<NS4:ContactPoint xmlns:NS4="http://www.lloydstsb.com/Schema/Infrastructure/SOAP">
			<NS4:ContactPointType>003</NS4:ContactPointType>
			<NS4:ContactPointId>0000309751</NS4:ContactPointId>
			<NS4:ApplicationId>AMD AL06614</NS4:ApplicationId>
			<NS4:OperatorType>System</NS4:OperatorType>
		</NS4:ContactPoint>
	</NS1:Header>
	<NS1:Body>
		<NS5:getPostingDetails xmlns:NS5="http://xml.lloydsbanking.com/Schema/Enterprise/TMH/AMD/AMDServices/NPADetails/1.2.7">
			<NS5:Header>
				<NS5:MsgTypeId>PostingService</NS5:MsgTypeId>
				<NS5:MsgVersionId>1.2.6</NS5:MsgVersionId>
				<NS5:ChannelId>Transaction Bus</NS5:ChannelId>
			</NS5:Header>
			<NS5:PostingReq>
				<NS5:TransactionId>2182801</NS5:TransactionId>
				<NS5:PlatformId>00004</NS5:PlatformId>
				<NS5:PaymentScheme>GBPTransfer</NS5:PaymentScheme>
				<NS5:PaymentType>Outbound</NS5:PaymentType>
				<NS5:FromCurrencyCd>GBP</NS5:FromCurrencyCd>
				<NS5:ToCurrencyCd>GBP</NS5:ToCurrencyCd>
				<NS5:TransactionType>Normal</NS5:TransactionType>
				<NS5:Amount>1.00</NS5:Amount>
				<NS5:AccountNo>04198101</NS5:AccountNo>
				<NS5:SortCd>309751</NS5:SortCd>
				<NS5:CrDrIn>DR</NS5:CrDrIn>
				<NS5:NPAOnlyPosting>N</NS5:NPAOnlyPosting>
				<NS5:Narrative>Defect 16095             TO 04198101 309751       </NS5:Narrative>
				<NS5:Description>Defect 16095             TO 04198101 309751       </NS5:Description>
			</NS5:PostingReq>
			<NS5:PostingReq>
				<NS5:TransactionId>2182901</NS5:TransactionId>
				<NS5:PlatformId>00004</NS5:PlatformId>
				<NS5:PaymentScheme>GBPTransfer</NS5:PaymentScheme>
				<NS5:PaymentType>Inbound</NS5:PaymentType>
				<NS5:FromCurrencyCd>GBP</NS5:FromCurrencyCd>
				<NS5:ToCurrencyCd>GBP</NS5:ToCurrencyCd>
				<NS5:TransactionType>Normal</NS5:TransactionType>
				<NS5:Amount>1.00</NS5:Amount>
				<NS5:AccountNo>30456768</NS5:AccountNo>
				<NS5:SortCd>309664</NS5:SortCd>
				<NS5:CrDrIn>CR</NS5:CrDrIn>
				<NS5:NPAOnlyPosting>N</NS5:NPAOnlyPosting>
				<NS5:Narrative>Test 16095               FR 30456768 309664       </NS5:Narrative>
				<NS5:Description>Test 16095               FR 30456768 309664       </NS5:Description>
			</NS5:PostingReq>
		</NS5:getPostingDetails>
	</NS1:Body>
</NS1:Envelope>
